In [2]:
import pandas as pd
import numpy as np

In [3]:
from pandas import Series, DataFrame

In [12]:
obj = pd.Series([10,5,1,-3], index =['a','b','c','d'])
obj

a    10
b     5
c     1
d    -3
dtype: int64

In [14]:
obj2 = pd.Series([5,0,100,-3],index =['b','c','e','d'])

In [15]:
obj+obj2

a     NaN
b    10.0
c     1.0
d    -6.0
e     NaN
dtype: float64

In [8]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj[0]

4

In [16]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [17]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [18]:
'b' in obj2

True

In [19]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [21]:
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000}

In [25]:
type(sdata)

dict

In [26]:
obj3 = pd.Series(sdata)

In [27]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
states = {'California', 'Ohio', 'Oregon', 'Texas'}

In [29]:
obj4 = pd.Series(sdata, index = states)

In [30]:
obj4

Texas         71000.0
California        NaN
Oregon        16000.0
Ohio          35000.0
dtype: float64

In [31]:
pd.isnull(obj4)

Texas         False
California     True
Oregon        False
Ohio          False
dtype: bool

In [32]:
pd.notnull(obj4)

Texas          True
California    False
Oregon         True
Ohio           True
dtype: bool

In [33]:
obj4.isnull()

Texas         False
California     True
Oregon        False
Ohio          False
dtype: bool

In [34]:
obj4

Texas         71000.0
California        NaN
Oregon        16000.0
Ohio          35000.0
dtype: float64

In [35]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [36]:
obj3+obj4
#Utah는 obj4에 없어서 Nan이 나오는거야

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [37]:
obj4.name = 'population'

In [38]:
obj4.index.name = 'state'

In [39]:
obj4

state
Texas         71000.0
California        NaN
Oregon        16000.0
Ohio          35000.0
Name: population, dtype: float64

In [40]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [42]:
type(data)

dict

In [43]:
frame = pd.DataFrame(data)

In [44]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [45]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])

In [46]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [47]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [49]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [58]:
frame2['debt']=16.5

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [60]:
frame2['debt']=np.arange(6.0)

In [61]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [62]:
val = pd.Series([-1.2,-1.5,-1.7],index =['two','four','five'])

In [63]:
frame2.debt = val

In [64]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [65]:
frame2['eastern']=frame2.state=='Ohio'

In [66]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [67]:
del frame2['eastern']

In [68]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [105]:
pop={'Neveda':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [106]:
frame3 = pd.DataFrame(pop)

In [107]:
frame3

      Neveda  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [108]:
pd.DataFrame(pop,index=[2000,2001,2002])

      Neveda  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [109]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Neveda':frame3['Neveda'][:2]}

In [110]:
pd.DataFrame(pdata)

      Ohio  Neveda
2001   1.7     2.4
2002   3.6     2.9

In [111]:
frame3.index.name='year'

In [112]:
frame3.columns.name='state'

In [225]:
frame3

state  Neveda  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [114]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [115]:
obj = pd.Series(range(3),index=['a','b','c'])

In [116]:
obj

a    0
b    1
c    2
dtype: int64

In [117]:
index = obj.index

In [118]:
index

Index(['a', 'b', 'c'], dtype='object')

In [119]:
obj.index=['e','f','g']

In [120]:
obj

e    0
f    1
g    2
dtype: int64

In [121]:
labels = pd.Index(np.arange(3))

In [122]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [123]:
obj2 = pd.Series([1.5,-2.5,5.0],index = labels)

In [124]:
obj2

0    1.5
1   -2.5
2    5.0
dtype: float64

In [125]:
obj2.index is labels

True

##
#
#

#


#

#

#

#
HW 201600282 엄기산
#
#

In [226]:
frame3

state  Neveda  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [227]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Neveda':frame3['Neveda'][:2]}

In [228]:
pd.DataFrame(pdata)

      Ohio  Neveda
year
2001   1.7     2.4
2002   3.6     2.9

In [127]:
frame3.columns

Index(['Neveda', 'Ohio'], dtype='object', name='state')

In [128]:
'Ohio' in frame3.columns

True

In [129]:
2003 in frame3.index

False

In [130]:
dup_lables = pd.Index(['foo','foo','bar','bar'])

In [132]:
dup_lables

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [133]:
obj = pd.Series([4.5,7.2,5.3,3.6], index = ['d','b','a','c'])

In [134]:
obj

d    4.5
b    7.2
a    5.3
c    3.6
dtype: float64

In [137]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [138]:
obj2

a    5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [139]:
obj3 = pd.Series(['blue','purple','tellow'], index=[0,2,4])

In [140]:
obj3

0      blue
2    purple
4    tellow
dtype: object

In [141]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    tellow
5       NaN
dtype: object

In [142]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    tellow
5    tellow
dtype: object

In [144]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [145]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [146]:
frame2 = frame.reindex(['a','b','c','d'])

In [147]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [148]:
frame2 = frame.reindex(['a','b','c','d'],method='ffill')

In [149]:
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [151]:
states = ['Texas','Utah','California']

In [154]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [157]:
frame.reindex(['a','b','c','d'],states)

<ipython-input-157-dd639d5b1969>:1: FutureWarning: Interpreting call
	'.reindex(a, b)' as
	'.reindex(index=a, columns=b)'.
Use named arguments to remove any ambiguity. In the future, using positional arguments for 'index' or 'columns' will raise a 'TypeError'.
  frame.reindex(['a','b','c','d'],states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [159]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])

In [160]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [161]:
new_obj = obj.drop('c')

In [162]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [164]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [165]:
data = pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [166]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [177]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [179]:
obj.drop('c',inplace=True)

In [180]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [182]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])

In [183]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [184]:
obj['b']

1.0

In [185]:
obj[1]

1.0

In [186]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [188]:
obj[['b','a','c','d']]

b    1.0
a    0.0
c    2.0
d    3.0
dtype: float64

In [189]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [190]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [191]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

#

#

#

#

# 10주차 201600282 엄기산 HW2

In [192]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [193]:
obj[1]

1.0

In [194]:
obj[3]

3.0

In [195]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [196]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [197]:
obj['b':'c']=5

In [198]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [17]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [18]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [204]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [210]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [211]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [212]:
data[data<5]=0

In [16]:
data

NameError: name 'data' is not defined

In [214]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

#

#

#

#

#

#10주차 201600282 엄기산 HW2

In [216]:
data.iloc[1,[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [217]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [218]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [220]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [221]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [222]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14